## Plan changes
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`



```terraform
Plan: 6 to add, 2 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.synthetic_canary_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "synthetic_canary_policy"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetBucketLocation",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:ca-central-1:595701125956:log-group:/aws/lambda/cwsyn-qr-code-status-*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListAllMyBuckets",
              + "xray:PutTraceSegments",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "cloudwatch:PutMetricData",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "CloudWatchSynthetics",
                ]
              + variable = "cloudwatch:namespace"
            }
        }
    }

  # aws_iam_policy.synthetic_canary_policy will be created
  + resource "aws_iam_policy" "synthetic_canary_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "SyntheticCanaryPolicy"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role.synthetic_canary_execution_role will be created
  + resource "aws_iam_role" "synthetic_canary_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "synthetic_canary_role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.synthetic_canary_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "synthetic_canary_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "synthetic_canary_role"
    }

  # aws_s3_bucket.synthetic_artifacts will be created
  + resource "aws_s3_bucket" "synthetic_artifacts" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "covid-portal-synthetic-artifacts-staging"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + enabled = true
          + id      = (known after apply)

          + expiration {
              + days = 31
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_s3_bucket_public_access_block.qr_code_canary will be created
  + resource "aws_s3_bucket_public_access_block" "qr_code_canary" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_security_group.covidportal_database will be updated in-place
  ~ resource "aws_security_group" "covidportal_database" {
        arn                    = "arn:aws:ec2:ca-central-1:595701125956:security-group/sg-0b504be9bc339ca2d"
        description            = "Ingress - covidportal Database"
        egress                 = []
        id                     = "sg-0b504be9bc339ca2d"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-040bf1b90992b0ddb",
                ]
              - self             = false
              - to_port          = 5432
            },
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-06fb0b5a42b7e0672",
                  - "sg-0af309d95c034c0ea",
                ]
              - self             = false
              - to_port          = 5432
            },
          + {
              + cidr_blocks      = []
              + description      = null
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-06fb0b5a42b7e0672",
                  + "sg-0af309d95c034c0ea",
                ]
              + self             = false
              + to_port          = 5432
            },
        ]
        name                   = "covidportal-database"
        owner_id               = "595701125956"
        revoke_rules_on_delete = false
        tags                   = {
            "CostCentre" = "CovidPortal_Staging"
        }
        tags_all               = {
            "CostCentre" = "CovidPortal_Staging"
        }
        vpc_id                 = "vpc-0e71ff594dff0ef9d"
    }

  # aws_synthetics_canary.qr_code_status will be created
  + resource "aws_synthetics_canary" "qr_code_status" {
      + arn                      = (known after apply)
      + artifact_s3_location     = (known after apply)
      + engine_arn               = (known after apply)
      + execution_role_arn       = (known after apply)
      + failure_retention_period = 31
      + handler                  = "exports.handler"
      + id                       = (known after apply)
      + name                     = "qr-code-status"
      + runtime_version          = "syn-nodejs-puppeteer-3.1"
      + source_location_arn      = (known after apply)
      + start_canary             = true
      + status                   = (known after apply)
      + success_retention_period = 31
      + tags_all                 = (known after apply)
      + timeline                 = (known after apply)
      + zip_file                 = "qr-code-status.js.zip"

      + run_config {
          + active_tracing     = (known after apply)
          + memory_in_mb       = (known after apply)
          + timeout_in_seconds = (known after apply)
        }

      + schedule {
          + expression = "rate(5 minutes)"
        }
    }

  # aws_wafv2_web_acl.qrcode_acl will be updated in-place
  ~ resource "aws_wafv2_web_acl" "qrcode_acl" {
        arn        = "arn:aws:wafv2:ca-central-1:595701125956:regional/webacl/qrcode/90ed9118-ca41-437c-862b-a8d6cb10a584"
        capacity   = 1126
        id         = "90ed9118-ca41-437c-862b-a8d6cb10a584"
        lock_token = "ed5519f5-5f4e-4ad8-ac07-f6cf306bac4f"
        name       = "qrcode"
        scope      = "REGIONAL"
        tags       = {
            "CostCentre" = "CovidPortal_Staging"
        }
        tags_all   = {
            "CostCentre" = "CovidPortal_Staging"
        }

        default_action {
            allow {
            }
        }

        rule {
            name     = "CanadaOnlyGeoRestriction"
            priority = 5

            action {

                block {
                    custom_response {
                        response_code = 403

                        response_header {
                            name  = "waf-block"
                            value = "CanadaOnlyGeoRestriction"
                        }
                    }
                }
            }

            statement {

                not_statement {
                    statement {

                        geo_match_statement {
                            country_codes = [
                                "CA",
                            ]
                        }
                    }
                }
            }

            visibility_config {
                cloudwatch_metrics_enabled = true
                metric_name                = "CanadaOnlyGeoRestriction"
                sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "PostRequestLimit"
          + priority = 102

          + action {

              + block {
                }
            }

          + statement {

              + rate_based_statement {
                  + aggregate_key_type = "IP"
                  + limit              = 100

                  + scope_down_statement {

                      + byte_match_statement {
                          + positional_constraint = "EXACTLY"
                          + search_string         = "post"

                          + field_to_match {

                              + method {}
                            }

                          + text_transformation {
                              + priority = 1
                              + type     = "LOWERCASE"
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "PostRequestRateLimit"
              + sampled_requests_enabled   = true
            }
        }
        rule {
            name     = "AWSManagedRulesAmazonIpReputationList"
            priority = 1

            override_action {

                none {}
            }

            statement {

                managed_rule_group_statement {
                    name        = "AWSManagedRulesAmazonIpReputationList"
                    vendor_name = "AWS"
                }
            }

            visibility_config {
                cloudwatch_metrics_enabled = true
                metric_name                = "AWSManagedRulesAmazonIpReputationList"
                sampled_requests_enabled   = true
            }
        }
        rule {
            name     = "AWSManagedRulesCommonRuleSet"
            priority = 2

            override_action {

                none {}
            }

            statement {

                managed_rule_group_statement {
                    name        = "AWSManagedRulesCommonRuleSet"
                    vendor_name = "AWS"
                }
            }

            visibility_config {
                cloudwatch_metrics_enabled = true
                metric_name                = "AWSManagedRulesCommonRuleSet"
                sampled_requests_enabled   = true
            }
        }
        rule {
            name     = "AWSManagedRulesKnownBadInputsRuleSet"
            priority = 3

            override_action {

                none {}
            }

            statement {

                managed_rule_group_statement {
                    name        = "AWSManagedRulesKnownBadInputsRuleSet"
                    vendor_name = "AWS"
                }
            }

            visibility_config {
                cloudwatch_metrics_enabled = true
                metric_name                = "AWSManagedRulesKnownBadInputsRuleSet"
                sampled_requests_enabled   = true
            }
        }
        rule {
            name     = "AWSManagedRulesLinuxRuleSet"
            priority = 4

            override_action {

                none {}
            }

            statement {

                managed_rule_group_statement {
                    name        = "AWSManagedRulesLinuxRuleSet"
                    vendor_name = "AWS"
                }
            }

            visibility_config {
                cloudwatch_metrics_enabled = true
                metric_name                = "AWSManagedRulesLinuxRuleSet"
                sampled_requests_enabled   = true
            }
        }

        visibility_config {
            cloudwatch_metrics_enabled = true
            metric_name                = "covid_portal_global_rule"
            sampled_requests_enabled   = false
        }
    }

Plan: 6 to add, 2 to change, 0 to destroy.

Changes to Outputs:
    ecs_cluster                  = {
        arn                                = "arn:aws:ecs:ca-central-1:595701125956:cluster/covid-portal_staging"
        capacity_providers                 = [
            "FARGATE",
        ]
        configuration                      = []
        default_capacity_provider_strategy = [
            {
                base              = 2
                capacity_provider = "FARGATE"
                weight            = 1
            },
        ]
        id                                 = "arn:aws:ecs:ca-central-1:595701125956:cluster/covid-portal_staging"
        name                               = "covid-portal_staging"
        setting                            = [
            {
                name  = "containerInsights"
                value = "enabled"
            },
        ]
        tags                               = {
            "CostCentre" = "CovidPortal_Staging"
        }
        tags_all                           = {
            "CostCentre" = "CovidPortal_Staging"
        }
    }
    security_group_egress        = {
        arn                    = "arn:aws:ec2:ca-central-1:595701125956:security-group/sg-006789af77a3fbdcb"
        description            = "Egress - CovidShield External Services"
        egress                 = [
            {
                cidr_blocks      = [
                    "0.0.0.0/0",
                ]
                description      = "Security group rule for Portal New Relic egress"
                from_port        = 443
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "tcp"
                security_groups  = []
                self             = false
                to_port          = 443
            },
            {
                cidr_blocks      = [
                    "0.0.0.0/0",
                ]
                description      = "Security group rule for Portal email egress"
                from_port        = 587
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "tcp"
                security_groups  = []
                self             = false
                to_port          = 587
            },
        ]
        id                     = "sg-006789af77a3fbdcb"
        ingress                = []
        name                   = "egress-anywhere"
        name_prefix            = ""
        owner_id               = "595701125956"
        revoke_rules_on_delete = false
        tags                   = {
            "CostCentre" = "CovidPortal_Staging"
        }
        tags_all               = {
            "CostCentre" = "CovidPortal_Staging"
        }
        timeouts               = null
        vpc_id                 = "vpc-0e71ff594dff0ef9d"
    }
    security_group_load_balancer = {
        arn                    = "arn:aws:ec2:ca-central-1:595701125956:security-group/sg-0ddadcce9ea825a8e"
        description            = "Ingress - covidportal Load Balancer"
        egress                 = [
            {
                cidr_blocks      = [
                    "172.16.0.0/16",
                ]
                description      = ""
                from_port        = 8000
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "tcp"
                security_groups  = []
                self             = false
                to_port          = 8000
            },
        ]
        id                     = "sg-0ddadcce9ea825a8e"
        ingress                = [
            {
                cidr_blocks      = [
                    "0.0.0.0/0",
                ]
                description      = ""
                from_port        = 443
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "tcp"
                security_groups  = []
                self             = false
                to_port          = 443
            },
            {
                cidr_blocks      = [
                    "0.0.0.0/0",
                ]
                description      = ""
                from_port        = 80
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "tcp"
                security_groups  = []
                self             = false
                to_port          = 80
            },
        ]
        name                   = "covidportal-load-balancer"
        name_prefix            = ""
        owner_id               = "595701125956"
        revoke_rules_on_delete = false
        tags                   = {
            "CostCentre" = "CovidPortal_Staging"
        }
        tags_all               = {
            "CostCentre" = "CovidPortal_Staging"
        }
        timeouts               = null
        vpc_id                 = "vpc-0e71ff594dff0ef9d"
    }

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>